In [11]:
import numpy as np
import pandas as pd
from numpy.random import rand

In [12]:
np.random.seed(101)

In [13]:
df=pd.DataFrame(rand(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [14]:
df

          W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239

In [ ]:
df['W']

A    0.516399
B    0.685277
C    0.721544
D    0.181892
E    0.083561
Name: W, dtype: float64

In [16]:
type(df['W'])

pandas.core.series.Series

In [17]:
df.W

A    0.516399
B    0.685277
C    0.721544
D    0.181892
E    0.083561
Name: W, dtype: float64

In [19]:
df[['W','Z']]

          W         Z
A  0.516399  0.171522
B  0.685277  0.893613
C  0.721544  0.352132
D  0.181892  0.232354
E  0.083561  0.276239

In [29]:
df['new']=df.W+df.Z
df

          W         X         Y         Z       new
A  0.516399  0.570668  0.028474  0.171522  0.687920
B  0.685277  0.833897  0.306966  0.893613  1.578890
C  0.721544  0.189939  0.554228  0.352132  1.073676
D  0.181892  0.785602  0.965483  0.232354  0.414246
E  0.083561  0.603548  0.728993  0.276239  0.359800

In [30]:
df.drop('new',axis=1,inplace=True)

In [31]:
df

          W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239

In [32]:
df.drop('E',axis=0)

          W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354

In [35]:
df.shape

(5, 4)

In [37]:
df[['Z','X']]

          Z         X
A  0.171522  0.570668
B  0.893613  0.833897
C  0.352132  0.189939
D  0.232354  0.785602
E  0.276239  0.603548

In [38]:
df.loc['A']

W    0.516399
X    0.570668
Y    0.028474
Z    0.171522
Name: A, dtype: float64

In [43]:
df.iloc[2]

W    0.721544
X    0.189939
Y    0.554228
Z    0.352132
Name: C, dtype: float64

In [46]:
df.loc['C':]

          W         X         Y         Z
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239

In [51]:
df.loc['C','Y']

np.float64(0.5542275911247871)

In [52]:
df.loc[['A','D'],['W','Z']]

          W         Z
A  0.516399  0.171522
D  0.181892  0.232354